{
    "pageTitle": "Chinese Chess Tutorial",
    "headerTitle": "Chinese Chess Tutorial",
    "welcomeMessage": "Welcome to the Chinese Chess Tutorial! Here are the basic rules for beginners.",
    "tocPieces": "Pieces",
    "tocGeneral": "General",
    "tocAdvisor": "Advisor",
    "tocElephant": "Elephant",
    "tocChariot": "Chariot",
    "tocHorse": "Horse",
    "tocCannon": "Cannon",
    "tocSoldier": "Soldier",
    "tocConcepts": "Concepts",
    "piecesTitle": "Piece Movements and Captures",
    "generalTitle": "General (帥 / 將)",
    "generalMove": "<strong>Movement:</strong> Moves one space orthogonally (horizontally or vertically) within the palace.",
    "generalMoveCaption": "The General can move one space up, down, left, or right within the palace.",
    "generalRule": "<strong>Special Rule:</strong> The two Generals cannot face each other on the same file without any intervening pieces. This is known as \"flying general\".",
    "generalConcept": "<strong>Concept:</strong> The General is the sole target of the game; its safety is paramount. Although its movement is limited, it can participate in offense during the endgame, a tactic known as \"the General leaves the palace\".",
    "generalConceptCaption": "Because the Generals cannot face each other, the red General cannot move to the right.",
    "advisorTitle": "Advisor (仕 / 士)",
    "advisorMove": "<strong>Movement:</strong> Moves one space diagonally within the palace. It is the General's bodyguard.",
    "advisorMoveCaption": "The Advisor moves one space diagonally within the palace.",
    "advisorConcept": "<strong>Concept:</strong> Its primary value is defensive, protecting the core area around the General. Avoid sacrificing it lightly, as its loss can create serious vulnerabilities.",
    "advisorConceptCaption": "The main task of the Advisor is to protect the General. Two advisors linked together form a strong defense.",
    "elephantTitle": "Elephant (相 / 象)",
    "elephantMove": "<strong>Movement:</strong> Moves two spaces diagonally, like crossing the corners of a 2x2 square. This is known as \"flying elephant\".",
    "elephantMoveCaption": "The Elephant moves two points diagonally.",
    "elephantRule": "<strong>Special Rule:</strong> Cannot cross the river. If there is a piece in the center of the 2x2 square (blocking the elephant's eye), it cannot move in that direction.",
    "elephantRuleCaption": "The Elephant cannot cross the river. It is blocked if a piece is in the 'eye' (center of the move).",
    "elephantConcept": "<strong>Concept:</strong> A key defensive piece that works with the Advisor to solidify the defense. Its weakness is its limited range and vulnerability to being blocked, making it a target for enemy Soldiers or Chariots.",
    "elephantConceptCaption": "Elephants and Advisors form a defensive line to protect the General.",
    "chariotTitle": "Chariot (俥 / 車)",
    "chariotMove": "<strong>Movement:</strong> Moves any number of spaces orthogonally, as long as its path is not blocked.",
    "chariotMoveCaption": "The Chariot moves in straight lines horizontally or vertically.",
    "chariotConcept": "<strong>Concept:</strong> The most powerful attacking piece in the game. A common saying, \"one chariot is worth ten pieces,\" describes its immense controlling power. It is a key piece in all phases of the game.",
    "chariotConceptCaption": "As shown above, the double Chariots, assisted by the General, can capture the King. Extremely powerful.",
    "horseTitle": "Horse (傌 / 馬)",
    "horseMove": "<strong>Movement:</strong> Moves one space orthogonally and then one space diagonally outwards.",
    "horseRule": "<strong>Special Rule:</strong> Its orthogonal path can be blocked by an adjacent piece (a \"hobbled horse\"), preventing it from moving in that direction.",
    "horseConcept": "<strong>Concept:</strong> A very flexible piece with a wide attack range, capable of threatening multiple targets simultaneously. Horse positioning is crucial, with formations like \"linked horses\" for defense and classic attacks like the \"臥槽馬\" (crouching horse) and \"盤河馬\" (riverbank horse). Its power increases in the endgame as there are fewer pieces to block it.",
    "cannonTitle": "Cannon (炮 / 包)",
    "cannonMove": "<strong>Movement:</strong> When not capturing, it moves exactly like a Chariot.",
    "cannonCapture": "<strong>Capture:</strong> The Cannon is the only piece that captures differently than it moves. It must jump over exactly one piece (friend or foe, called a \"cannon platform\") to capture an enemy piece behind it.",
    "cannonConcept": "<strong>Concept:</strong> A long-range attacker that is extremely threatening when the board is crowded at the start of the game. The \"Central Cannon\" opening is one of the most fundamental tactics. In contrast to the Horse, its value decreases in the endgame as cannon platforms become scarce.",
    "soldierTitle": "Soldier (兵 / 卒)",
    "soldierMove": "<strong>Movement:</strong> Before crossing the river, it can only move one space forward. After crossing, it can move one space forward, left, or right, but never backward.",
    "soldierConcept": "<strong>Concept:</strong> The Soldier's value lies in its potential. Before the river, it serves a defensive role. Once across, its power increases dramatically. A soldier deep in enemy territory, controlling the palace, can sometimes be as valuable as a major piece.",
    "conceptsTitle": "Basic Concepts",
    "checkConcept": "<strong>Check:</strong> A move that threatens to capture the enemy General on the next turn.",
    "checkmateConcept": "<strong>Checkmate:</strong> The enemy General is in check and there is no legal move to escape the check. The game ends.",
    "stalemateConcept": "<strong>Stalemate:</strong> It is a player's turn to move, their General is not in check, but they have no legal moves. This results in a loss for the stalemated player."
}