{
    "pageTitle": "Hướng dẫn chơi Cờ Tướng",
    "headerTitle": "Hướng dẫn chơi Cờ Tướng",
    "welcomeMessage": "Chào mừng bạn đến với Hướng dẫn chơi Cờ Tướng! Dưới đây là các quy tắc cơ bản cho người mới bắt đầu.",
    "tocPieces": "Quân cờ",
    "tocGeneral": "Tướng",
    "tocAdvisor": "Sĩ",
    "tocElephant": "Tượng",
    "tocChariot": "Xe",
    "tocHorse": "Mã",
    "tocCannon": "Pháo",
    "tocSoldier": "Tốt",
    "tocConcepts": "Khái niệm",
    "piecesTitle": "Cách đi và cách ăn quân",
    "generalTitle": "Tướng / Soái",
    "generalMove": "<strong>Cách đi:</strong> Đi từng ô một theo đường ngang hoặc dọc trong cung.",
    "generalMoveCaption": "Tướng/Soái có thể đi một ô lên, xuống, trái, hoặc phải trong cung.",
    "generalRule": "<strong>Quy tắc đặc biệt:</strong> Hai Tướng không được đối mặt nhau trên cùng một cột dọc mà không có quân cản ở giữa. Điều này được gọi là \"lộ mặt tướng\".",
    "generalConcept": "<strong>Khái niệm:</strong> Tướng là mục tiêu duy nhất của trò chơi; sự an toàn của nó là trên hết. Mặc dù khả năng di chuyển hạn chế, nó có thể tham gia tấn công trong tàn cuộc, một chiến thuật được gọi là \"Tướng xuất cung\".",
    "generalConceptCaption": "Vì hai Tướng không được đối mặt nhau, Tướng đỏ không thể đi sang phải.",
    "advisorTitle": "Sĩ (仕 / 士)",
    "advisorMove": "<strong>Cách đi:</strong> Đi chéo một ô mỗi nước trong cung. Là vệ sĩ của Tướng.",
    "advisorMoveCaption": "Sĩ đi chéo một ô trong cung.",
    "advisorConcept": "<strong>Khái niệm:</strong> Giá trị chính của nó là phòng thủ, bảo vệ khu vực trung tâm quanh Tướng. Tránh hy sinh nó một cách nhẹ dạ, vì mất nó có thể tạo ra những lỗ hổng nghiêm trọng.",
    "advisorConceptCaption": "Nhiệm vụ chính của Sĩ là bảo vệ Tướng. Hai quân Sĩ liên kết với nhau tạo thành một hàng phòng thủ vững chắc.",
    "elephantTitle": "Tượng (相 / 象)",
    "elephantMove": "<strong>Cách đi:</strong> Đi chéo hai ô mỗi nước, giống như đi qua các góc của một hình vuông 2x2. Điều này được gọi là \"Tượng phi\".",
    "elephantMoveCaption": "Tượng đi chéo 2 ô (đi hình chữ Điền).",
    "elephantRule": "<strong>Quy tắc đặc biệt:</strong> Không được qua sông. Nếu có một quân cờ ở trung tâm của hình vuông 2x2 (cản mắt Tượng), nó không thể đi theo hướng đó.",
    "elephantRuleCaption": "Tượng không được qua sông. Nếu có quân chặn ở giữa (cản mắt Tượng), nó không thể di chuyển.",
    "elephantConcept": "<strong>Khái niệm:</strong> Một quân cờ phòng thủ quan trọng, phối hợp với Sĩ để củng cố hàng phòng thủ. Điểm yếu của nó là phạm vi di chuyển hạn chế và dễ bị cản, làm cho nó trở thành mục tiêu của Tốt hoặc Xe của đối phương.",
    "elephantConceptCaption": "Tượng và Sĩ tạo thành tuyến phòng thủ bảo vệ Tướng.",
    "chariotTitle": "Xe (俥 / 車)",
    "chariotMove": "<strong>Cách đi:</strong> Đi ngang hoặc dọc bao nhiêu ô tùy ý, miễn là không có quân cản trên đường đi.",
    "chariotConcept": "<strong>Khái niệm:</strong> Quân cờ tấn công mạnh nhất trong trò chơi. Một câu nói phổ biến, \"một Xe bằng mười quân,\" mô tả sức mạnh kiểm soát to lớn của nó. Nó là một quân cờ chủ chốt trong tất cả các giai đoạn của ván cờ.",
    "horseTitle": "Mã (傌 / 馬)",
    "horseMove": "<strong>Cách đi:</strong> Đi theo hình chữ L, một ô ngang hoặc dọc rồi một ô chéo ra ngoài.",
    "horseRule": "<strong>Quy tắc đặc biệt:</strong> Đường đi của nó có thể bị cản bởi một quân cờ liền kề (\"cản Mã\"), ngăn không cho nó đi theo hướng đó.",
    "horseConcept": "<strong>Khái niệm:</strong> Một quân cờ rất linh hoạt với phạm vi tấn công rộng, có khả năng đe dọa nhiều mục tiêu cùng một lúc. Vị trí của Mã rất quan trọng, với các thế cờ như \"Mã liên hoàn\" để phòng thủ và các cuộc tấn công kinh điển như \"Mãọa Tào\" và \"Mã Bàn Hà\". Sức mạnh của nó tăng lên trong tàn cuộc vì có ít quân cờ hơn để cản nó.",
    "cannonTitle": "Pháo (炮 / 包)",
    "cannonMove": "<strong>Cách đi:</strong> Khi không ăn quân, nó đi giống hệt như Xe.",
    "cannonCapture": "<strong>Cách ăn quân:</strong> Pháo là quân duy nhất có cách ăn quân khác với cách đi. Nó phải nhảy qua đúng một quân cờ (bạn hoặc thù, được gọi là \"ngòi pháo\") để ăn một quân cờ của đối phương ở phía sau.",
    "cannonConcept": "<strong>Khái niệm:</strong> Một quân tấn công tầm xa cực kỳ nguy hiểm khi bàn cờ đông quân lúc bắt đầu. Khai cuộc \"Pháo đầu\" là một trong những chiến thuật cơ bản nhất. Trái ngược với Mã, giá trị của nó giảm đi trong tàn cuộc vì ngòi pháo trở nên khan hiếm.",
    "soldierTitle": "Tốt (兵 / 卒)",
    "soldierMove": "<strong>Cách đi:</strong> Trước khi qua sông, nó chỉ có thể đi một ô về phía trước. Sau khi qua sông, nó có thể đi một ô về phía trước, sang trái hoặc sang phải, nhưng không bao giờ được đi lùi.",
    "soldierConcept": "<strong>Khái niệm:</strong> Giá trị của Tốt nằm ở tiềm năng của nó. Trước khi qua sông, nó có vai trò phòng thủ. Một khi đã qua sông, sức mạnh của nó tăng lên đáng kể. Một quân Tốt sâu trong lãnh thổ đối phương, kiểm soát cung điện, đôi khi có thể có giá trị như một quân cờ lớn.",
    "conceptsTitle": "Các khái niệm cơ bản",
    "checkConcept": "<strong>Chiếu:</strong> Một nước đi đe dọa bắt Tướng của đối phương ở nước tiếp theo.",
    "checkmateConcept": "<strong>Chiếu hết:</strong> Tướng của đối phương đang bị chiếu và không có nước đi hợp lệ nào để thoát khỏi thế chiếu. Trò chơi kết thúc.",
    "stalemateConcept": "<strong>Hết nước đi (Bức tử):</strong> Đến lượt một người chơi đi, Tướng của họ không bị chiếu, nhưng họ không có nước đi hợp lệ nào. Điều này dẫn đến thua cho người chơi bị hết nước đi."
}